CANT_CHOOSE_IN_ROW = (
    "Нельзя выбирать одного и того же игрока 2 ночи подряд"
)
CAN_CHOOSE_YOURSELF = "Можно выбирать себя"
CAN_CHOOSE_YOURSELF_AFTER_2_NIGHTS = (
    "Может выбрать себя только через 2 ночи"
)
KILLING_PLAYER = "Убийство игрока вражеской группировки"
SAVING_PLAYER = "Спасение игрока союзной или нейтральной группировки"
PAYMENT_FOR_NIGHTS = "Прожитые ночи (повышенная награда)"
CAN_KILL_AT_NIGHT = "Убивает ночью"
DONT_PAY_FOR_NIGHTS = "Не платят за прожитые ночи"
PAY_FOR_EARLY_DEATH = "За более раннюю смерть платят больше"
CHECKING_PLAYER = "Проверку игрока"
CAN_SEE_ALLIES = "Может видеть всех членов группировки"
DONT_PAY_FOR_VOTING = "Нет выплат за повешение игроков днём"
MAKES_MOVE_EVERY_ODD_NIGHT = (
    "Может делать ход только на нечётную ночь"
)
GUARANTEED_TO_KILL = "Убивает гарантированно, если игра не закончится раньше наступления следующей ночи"
